#include "Main.h"
#include "Game.h"

//	プレイヤー画像用の変数
int player_image;
//	プレイヤー座標
float player_x;
float player_y;

float speedmult;

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void GameInit()
{
	//	画像の読み込みと初期座標の設定
	player_image = LoadGraph( "data/player.bmp" );
	//	float 型の変数に数値を設定するので、float と分かるように後ろに f を付けてます
	player_x = 100.0f;
	player_y = 100.0f;

	speedmult = 1;

}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void GameUpdate()
{
	if( PushMouseInput() )
	{
		speedmult = 0;
		player_x = (float)GetMouseX()-25.0f;
		player_y = (float)GetMouseY()-25.0f;
	}

	player_y+=1*speedmult;
	speedmult+=0.3f;
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void GameRender()
{
	//	プレイヤーの描画（描画するための座標が float 型なので）
	DrawGraphF( player_x, player_y, player_image, TRUE );

	DrawString( 20, 20, "クリック：マウスの場所にプレイヤー座標設定", GetColor( 255, 255, 255 ) );
	DrawString( 20, 40, "→　画面下に落下移動（スピードを増やしながら下移動）", GetColor( 255, 255, 255 ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void GameExit()
{
	DeleteGraph( player_image );
}
