#include "Main.h"
#include "Game.h"
#include "Float3.h"

#include "Camera.h"
#include "Ground.h"
#include "Player.h"

//	今回のプロジェクトで必要なクラス
//	地面の宣言
Ground ground;
//	プレイヤーの宣言
Player player;
//	カメラの宣言
Camera camera;

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void GameInit()
{
	//	クラスの初期化関数
	ground.Init();
	player.Init();
	camera.Init();
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void GameUpdate()
{
	//	クラスの更新処理
	ground.Update();
	player.Update();

	//	プレイヤー座標を渡してカメラの更新処理
	camera.Update( player.m_pos );
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void GameRender()
{
	//	クラスの描画処理
	//	３Ｄモデルの描画の前にカメラの設定
	camera.Render();

	//	３Ｄモデルの描画
	ground.Render();
	player.Render();

	DrawString( 16, 16, "クラスで実装", GetColor( 255, 255, 255 ) );
	DrawString( 16, 32, "十字キー：プレイヤー移動（向きを変えて）", GetColor( 255, 255, 255 ) );
	DrawString( 16, 48, "スペース：ジャンプ", GetColor( 255, 255, 255 ) );
	DrawString( 16, 64, "→　プレイヤーは地面にいるときしかジャンプできない", GetColor( 255, 255, 0 ) );
	DrawString( 16, 80, "Ｆ１キー：ステージ全体を見るカメラ", GetColor( 255, 255, 255 ) );
	DrawString( 16, 96, "Ｆ２キー：プレイヤーを見るカメラ（プレイヤーがジャンプしても見る座標の高さはそのまま）", GetColor( 255, 255, 0 ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void GameExit()
{
	//	クラスの終了処理
	ground.Exit();
	player.Exit();
	camera.Exit();
}
