#include "Main.h"
#include "Game.h"
#include "Ground.h"

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void Ground::Init()
{
	//	地面モデルの読み込み
	m_model = MV1LoadModel( "data/ground.mqoz" );
	//	初期座標の設定（３Ｄ空間上の原点）
	m_pos.x = 0.0f;
	m_pos.y = 0.0f;
	m_pos.z = 0.0f;
	//	初期向きの設定（回転無し）
	m_rot.x = 0.0f;
	m_rot.y = 0.0f;
	m_rot.z = 0.0f;
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void Ground::Update()
{
	//	座標移動はしないので特に何もしない
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void Ground::Render()
{
	//	３Ｄモデルの座標設定
	MV1SetPosition( m_model, VGet( m_pos.x, m_pos.y, m_pos.z ) );
	//	３Ｄモデルの向き設定
	MV1SetRotationXYZ( m_model, VGet( TO_RADIAN( m_rot.x ), TO_RADIAN( m_rot.y ), TO_RADIAN( m_rot.z ) ) );
	//	３Ｄモデルの描画
	MV1DrawModel( m_model );

	//	目安として基準線の描画
	DrawLine3D( VGet( -50.0f, 0.0f,   0.0f ), VGet( 50.0f, 0.0f,  0.0f ), GetColor( 255, 0,   0 ) );
	DrawLine3D( VGet(   0.0f, 0.0f, -50.0f ), VGet(  0.0f, 0.0f, 50.0f ), GetColor(   0, 0, 255 ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void Ground::Exit()
{
	//	モデルの終了処理
	MV1DeleteModel( m_model );
}
