#include "Main.h"
#include "Game.h"

//	円の座標用の変数（数値が入るので int 型）
int pos_x;
int pos_y;
int rad;

int Cr1;
int Cr2;
int Cr3;
//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void GameInit()
{
	Cr1 = 255;
	Cr2 = 255;
	Cr3 = 0;
	rad = 20;
	//	変数の初期設定（画面の真ん中から開始したいので）
	pos_x = 400;
	pos_y = 225;
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------

void ColorRandomizer()
{
	Cr1 = GetRand(255);
	Cr2 = GetRand(255);
	Cr3 = GetRand(255);
}

void SizeRandomizer()
{
	pos_x = GetRand(SCREEN_W);
	pos_y = GetRand(SCREEN_H);
	rad = GetRand(35);
	if (rad < 5)
	{
		rad = 5;
	}
}

void GameUpdate()
{
	//	スペースキーを押したら
	
	if (PushHitKey(KEY_INPUT_SPACE)) {
		//	円を画面のどこか適当なところにしたい
		//	→　円の座標変数の値を画面のどこかの値にしたい
		//	Ｘ座標：０～８００のどれかの値にしたい
		//	GetRand( 数値 )	：０～数値までのどれかの値を返す関数
		pos_x = GetRand(800);
		//	Ｙ座標：０～４５０
		pos_y = GetRand(450);

		ColorRandomizer();
		SizeRandomizer();
	}
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void GameRender()
{
	//	pos_x pos_y の所に円を描画
	DrawCircle( pos_x, pos_y, rad, GetColor( Cr1, Cr2, Cr3 ) );

	DrawString( 20, 20, "スペース：円の座標設定（画面内にランダム）", GetColor( 255, 255, 255 ) );
	DrawString( 20, 40, "→　色をランダムに（ＲＧＢそれぞれ：０～２５５）", GetColor( 255, 255, 0 ) );
	DrawString( 20, 60, "→　半径もランダムに（５～３５）", GetColor( 255, 255, 0 ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void GameExit()
{
}
