#include "Main.h"
#include "Game.h"

//	円を左右に移動させたいのでＸ座標用の変数
int pos_x;
int pos_y;

//	Ｘ方向の移動量を入れる用の変数
int mov_x;
int mov_y;

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void GameInit()
{
	//	とりあえず横方向は真ん中にしとくので４００
	pos_x = 400;
	pos_y = 100;
	//	右移動から開始したいので
	mov_x = 5;
	mov_y = 5;

}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void GameUpdate()
{
	//	Ｘ方向の移動量（ mov_x ）をＸ座標（ pos_x ）に足す
	pos_x += mov_x;
	pos_y += mov_y;

	//	円のＸ座標が「右を超えた」もしくは「左を超えた」のであれば
	if( pos_x > 800 || pos_x < 0 ){
		//	移動量の符号を逆にします（プラスだったらマイナスに、マイナスだったらプラスに）
		mov_x *= -1;
	}
	if (pos_y > SCREEN_H || pos_y < 0) {
		//	移動量の符号を逆にします（プラスだったらマイナスに、マイナスだったらプラスに）
		mov_y *= -1;
	}
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void GameRender()
{
	//	Ｘ座標の変数の値を使って円の描画
	DrawCircle( pos_x, pos_y, 10, GetColor( 255, 255, 0 ) );

	DrawString( 20, 20, "円が上下左右に跳ね返るように移動", GetColor( 255, 255, 0 ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void GameExit()
{
}
